# RbsPanelScheduleSheetAppearanceParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsPanelScheduleSheetAppearanceParam Property
ParameterTypeId Class See Also
---
"Appearance On Sheet"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsPanelScheduleSheetAppearanceParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsPanelScheduleSheetAppearanceParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsPanelScheduleSheetAppearanceParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace